[
	{
		"title": "Rakshak Limited Edition CD",
		"linkUS": "https://bloodywoodstore.us/products/rakshak-limited-cd",
		"linkGlobal": "https://bloodywoodstore.us/products/rakshak-cd",
		"description": "<div><h6>Tracklist :</h6><ol><li>Gaddaar</li><li>Aaj</li><li>Zanjeero Se</li><li>Machi Bhasad (Album Version)</li><li>Dana-Dan</li><li>Jee Veerey (Album Version)</li><li>Endurant (Album Version)</li><li>Yaad (Album Version)</li><li>BSDK.exe</li><li>Chakh Le</li></ol></div>"
	},
	{
		"id": "kgvH6tX4Ej0",
		"title": "AaJ",
		"hindi": "आज",
		"date": "2022",
		"description": "Aaj is a song about the moment in time when you realise you have the strength to do what you have to do to become who you want to become. We all have our demons, our reasons to be stuck in a rut of harmful patterns and our fears of trying something new. This track is meant to act as a spark to light a fire within the listener to overcome all of that, it's about the fearless pursuit of the next level for as long as your heart continues to beat. It marks the first occasion where the band has combined the Indian flute with electronic elements as well as the usual dose of heavy riffs, diabolical growls and powerful rap verses."
	},

	{
		"id": "7iKjSCTxke8",
		"title": "GaddAaR",
		"hindi": "गद्दार",
		"date": "2021",
		"description": "This video contains heavy political commentary. It isn't aimed at a particular person, party or political mindset. We remain politically neutral. Honest."
	},

	{
		"id": "2bldupcptbE",
		"title": "YaAd",
		"hindi": "याद",
		"date": "2021",
		"description": "\"Yaad (Hindi for \"remember\" or \"in memory\") is about the power of accepting the loss of a loved one and moving on. The lyrics celebrate the permanent impact they have on us, reiterating the belief that we carry them in our best memories, no matter how far apart we may be. The music video is shot in between the snow-capped mountains of the Himalayas and urban India, the music video uses the bond between a man and a dog to highlight its message. The video will release on the 27th of March, 2020 along with the track. In spirit of the message, Bloodywood has partnered with the Posh Foundation (a non-government, not-for-profit animal shelter and rescue organization) and using the profits made on the very successful debut tour of Europe named \"Raj Against the Machine\" in 2019, purchased an animal ambulance van for the organization. This van will potentially help save the lives of 27,000 homeless animals in the National Capital Region of India over the next 5 years."
	},

	{
		"id": "Gsy5sJy5_34",
		"title": "MaCHi BhaSAd",
		"hindi": "माची भसाडी",
		"date": "2019",
		"description": "Originally created for the upcoming Ubisoft game \"Beyond Good and Evil 2\", Machi Bhasad is a track with a political message that celebrates the power of a new generation and its potential to be better than the last. Outside the context of the game, this song is intended as both a tribute and a call to action. It's a tribute to musicians and leaders who inspired people like ourselves to think and act in a way that'll benefit everyone. To question an unjust system that serves a few at the cost of the many.  It's a call to action for our generation to finish the work started by all those who came before us. To Become the straw that broke the proverbial camel's back, and change the world for the better."
	},
	{
		"id": "6uJoN_I9ebQ",
		"title": "JeE VEeREy",
		"hindi": "जी वीरे",
		"date": "2018",
		"description": "Amongst the calm grasslands, forests and fresh water streams of beloved Himachal Pradesh - here's an original folk metal track \"Jee Veerey\" (literal translation: Live, Brave One). A song that speaks about enduring and braving through a highly overlooked but rampant problem - mental illness. "
	},
	{
		"id": "i4FqGPRQWFM",
		"title": "aRi ArI",
		"hindi": "अरी अरी",
		"date": "2019",
		"description": "When Bloodywood takes metal to the streets of India!  Scenic alleys, busy intersections, horses, camels, weddings and LOTS of amused by-standers. The streets of India - where chaos fortifies balance. Indian metal band Bloodywood remakes a classic Indian folk song into a gut wrenching Metal song that redefines Unity, diversity and what humans are forgetting to practice these days!"
	}
]
