[
	{
		"author": "Kerrang!",
		"date": "Feb. 2022",
		"href": "https://www.kerrang.com/album-review-bloodywood-rakshak-india-metal",
		"stars": 4,
		"of": 5,
		"excerpt": "Bloodywood have a sound like no one else in the world right now. Rakshak is equal parts joyous, furious and incendiary and its creators look set to be the first Indian metal band to truly explode on a global scale."
	},
	{
		"author": "Distorted Sound Magazine",
		"date": "Feb. 2022",
		"href": "https://distortedsoundmag.com/album-review-rakshak-bloodywood/",
		"stars": 9,
		"of": 10,
		"excerpt": "It’s a throwback to the \"everything goes\" approach of the mid-90s when metal merged with whatever musical genre happened to be wandering past at the time, but is also a well-written, convincing statement of intent."
	},
	{
		"author": "Metalstorm",
		"date": "Feb. 2022",
		"href": "https://metalstorm.net/pub/review.php?review_id=17451",
		"stars": 8,
		"of": 10,
		"excerpt": "What sells me on Bloodywood most of all is the sheer energy: these guys are excited to be here making music, and the monstrous roars of these choruses and the dynamite swing of the verses pulse with the kind of electricity that will make you want to get up and jump."
	},
	{
		"author": "Rock N' Load",
		"date": "Feb. 2022",
		"href": "https://rocknloadmag.com/news/bloodywood-rakshak-album-review/",
		"stars": 9,
		"of": 10,
		"excerpt": "There’s a glorious mix of elements here, the structure of the songs as vibrant as India itself, from the ethereal vocals and flurry of guitarwork in ‘Zanjeero Se’ to the skyscraping force of ‘Yaad’, each has its own highs."
	},
	{
		"author": "Louder",
		"date": "Feb. 2022",
		"href": "https://www.loudersound.com/reviews/bloodywoods-rakshak-proves-they-are-more-than-just-an-internet-sensation",
		"stars": 0,
		"of": 0,
		"excerpt": "The flute-led Aaj and Linkin Park-influenced Zanjeero Se show the band’s impressive musical range whilst inherently staying true to their native roots, before BDSK.exe and Chakh Le deliver the most crushing of finales."
	}
]
